// 55 Задайте двумерный массив.
// напишите программу, которая заменяет строки на столбцы.
// в случае, если это невозможно, программа должна вывести сообщение для пользователя.
Console.WriteLine("Hello, World!");
