// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, 
//является ли этот день выходным
Console.WriteLine("Введите число");
int [] mas = new [31];
Console.WriteLine()
